const sortNum = require("../src/sortNum");

describe("세수정렬", () => {
  test("[3, 2, 1]을 입력받은 경우 [1, 2, 3]을 리턴해야 합니다", () => {
    expect(sortNum([3, 2, 1])).toEqual([1, 2, 3]);
  });

  test("[456, 345, 234]를 입력받은 경우 [234, 345, 456]을 리턴해야 합니다", () => {
    expect(sortNum([456, 345, 234])).toEqual([234, 345, 456]);
  });

  test("[10, 56, 90]을 입력받은 경우 그대로 리턴해야 합니다", () => {
    expect(sortNum([10, 56, 90])).toEqual([10, 56, 90]);
  });

  test("[3455, 1, 33, 5, 767]을 입력받은 경우 [1, 5, 33, 767, 3455]를 리턴해야 합니다", () => {
    expect(sortNum([3455, 1, 33, 5, 767])).toEqual([1, 5, 33, 767, 3455]);
  });
});
