/*

    나는 요리사다

    "나는 요리사다"는 다섯 참가자들이 서로의 요리 실력을 뽐내는 티비 프로입니다. 
    각 참가자는 자신있는 음식을 하나씩 만들어오고, 서로 다른 사람의 음식을 점수로 평가해줍니다. 
    점수는 1점부터 5점까지 있습니다.

    각 참가자가 얻은 점수는 다른 사람이 평가해 준 점수의 합이 됩니다.
    가장 많은 점수를 얻은 사람이 우승자가 됩니다. 

    함수 chef에 각 참가자가 얻은 평가 점수가 담겨있는 이중 배열 score가 주어졌을 때, 우승자의 점수를 리턴하세요. 
    항상 우승자가 유일한 경우만 주어집니다. 

    입출력 예시
    ---------------------------
      input             output
    ---------------------------
      score
    ---------------------------
    [[5, 4, 4, 5],          19
    [5, 4, 4, 4],
    [5, 5, 4, 4],
    [5, 5, 5, 4],
    [4, 4, 4, 5]]
*/

function chef(score) {
  // 여기에서 작업하세요.
}

// 최고로 높은 사람의 점수를 리턴하세요!!!
// 최고의 점수가 5,5,5,4 === 19이면 19를 리턴
// sore 안에 점수판이 있다.
// [[5, 4, 4, 5],
// [5, 4, 4, 4],
// [5, 5, 4, 4],
// [5, 5, 5, 4],
// [4, 4, 4, 5]]

// 이 점수들 합산해서 제일 높은 점수가 우승자가 된다.

// 우리는 그 점수를 return 합니다.

module.exports = chef;
